Tekla Open API Reference for Tekla Structures 2025
Element Properties
The RebarSpacing.ExactSpacing.Element type exposes the following members.
Properties
Name | Description
Distance
 Gets or sets the spacing distance in the element.
Number
 Gets or sets the number of spaces in the element.
Top
See Also
Reference
RebarSpacing.ExactSpacing.Element Structure
Tekla.Structures.Model Namespace